Documents/бит_ПолучениеФакта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ПолучениеФакта</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_ОборотыПоСметам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределения</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_СвойстваОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийФакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФактическиеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникДанных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ИсточникиДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСчет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсточникиДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗданиеПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникДанных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ИсточникиДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентПревышен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределения</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_СвойстваОбъектовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СводнаяТаблица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗданиеПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСчет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределения</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_СвойстваОбъектовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокЗданий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗданиеПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_Подразделение_Здание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_Подразделение_Здание</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ЗначениеСвойствОбъектовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ЗначениеСвойствОбъектовУчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_СвойстваОбъектовУчета</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСвойства</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_СвойстваОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/бит_ПолучениеФакта/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте
// Для перерасчета процента полсе удаления строки.
Перем мИдентификаторРодитель; // Переменная хранить идентификатор родителя дерева. 

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
// Вычисляет итог  по строкам табличной части, удовлетворяющим отбору.
//
// Параметры:
//  ТабЧасть  – ИмяТабличнойЧасти,
//  Отбор     - Структура,
//  ИмяРесурса- Строка. 
//
// Возвращаемое значение:
//   Итог   – Число.
//
Функция ВычислитьИтогСОтбором(ТабЧасть,Отбор,ИмяРесурса)
	
	Итог = 0; 
	МассивСтрок = Объект[ТабЧасть].НайтиСтроки(Отбор);
	
	Для каждого СтрокаТЧ Из МассивСтрок Цикл
		
		Итог = Итог+СтрокаТЧ[ИмяРесурса];
		
	КонецЦикла; 
	
	Возврат Итог;
	
КонецФункции

&НаКлиенте
// Разбивает сумму бюджета по зданиям.
//
// Параметры:
//  ТабЧасть  – ИмяТабличнойЧасти.
//  Отбор     - Структура.
//  СуммаИтог - Число. 
//
Процедура РазбитьСуммуПоЗданиям(Отбор, СуммаИтог)
	
	МассивСтрок = Объект.СводнаяТаблица.НайтиСтроки(Отбор);
	
	Количество = МассивСтрок.Количество();
	
	ПроцентИтог   = 0;
	СуммаКонтроль = 0;
	
	СтрокаМаксСумма = Неопределено;
	
	Для каждого СтрокаТЧ Из МассивСтрок Цикл
		
		Сумма   = 0;
		
		Сумма = Окр((СуммаИтог * СтрокаТЧ.Процент)/100, 2);
		СтрокаТЧ.Сумма   = Сумма;
		
		СуммаКонтроль   = СуммаКонтроль   + Сумма;
		
		ПроцентИтог = ПроцентИтог + СтрокаТЧ.Процент;
		
		Если СтрокаМаксСумма = Неопределено Тогда
			
			СтрокаМаксСумма = СтрокаТЧ;
			
		Иначе
			
			Если СтрокаМаксСумма.Сумма < Сумма Тогда
				
				СтрокаМаксСумма = СтрокаТЧ;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Если Количество > 0 Тогда
		
		РазницаСумма   = СуммаИтог   - СуммаКонтроль;
		
		Если РазницаСумма <> 0 Тогда
			
			СтрокаМаксСумма.Сумма   =  СтрокаМаксСумма.Сумма + РазницаСумма;
			
		КонецЕсли;
		
		РазницаПпроцент = 100  - ПроцентИтог;
		
		Если РазницаПпроцент <> 0 Тогда
			
			СтрокаМаксСумма.Процент   =  СтрокаМаксСумма.Процент + РазницаПпроцент;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПоСтроке(ИД)
	
	Отбор = Новый Структура("ИД", ИД);
	МассивСтрок = Объект.СводнаяТаблица.НайтиСтроки(Отбор);
	
	Для каждого СтрокаТабличнойЧасти Из МассивСтрок Цикл
		
		Объект.СводнаяТаблица.Удалить(СтрокаТабличнойЧасти);
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПостроке(ИД, ИмяРеквизита, Значение)
	
	Отбор = Новый Структура("ИД", ИД);
	МассивСтрок = Объект.СводнаяТаблица.НайтиСтроки(Отбор);
	
	Для каждого СтрокаТабличнойЧасти Из МассивСтрок Цикл
		
		СтрокаТабличнойЧасти[ИмяРеквизита] = Значение;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_ЗакрытыйСлужебныйСервер.ПроверитьВозможностьРаботы(Отказ, Истина);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	ОбновитьИсточникиДанныхДерево();
	
	Элементы.Итог.Заголовок = "Итого: " + Объект.ФактическиеДанные.Итог("Сумма") + "    ";
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(Объект.Ссылка, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	
	РазвернутьВсеУровни();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура НастроитьПериод(Команда)
	
	Период = Новый СтандартныйПериод;
	Период.ДатаНачала    = Объект.НачалоПериода;
	Период.ДатаОкончания = Объект.КонецПериода;
	
	ДиалогРедактированияПериода = Новый ДиалогРедактированияСтандартногоПериода;
	ДиалогРедактированияПериода.Период = Период;
	
	ДиалогРедактированияПериода.Показать(Новый ОписаниеОповещения("НастроитьПериодЗавершение", ЭтотОбъект, Новый Структура("ДиалогРедактированияПериода", ДиалогРедактированияПериода))); 
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПериодЗавершение(Период1, ДополнительныеПараметры) Экспорт
	
	ДиалогРедактированияПериода = ДополнительныеПараметры.ДиалогРедактированияПериода;
	
    Если ЗначениеЗаполнено(Период1) Тогда
		
		Объект.НачалоПериода = ДиалогРедактированияПериода.Период.ДатаНачала;
		Объект.КонецПериода  = ДиалогРедактированияПериода.Период.ДатаОкончания;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ВыполнитьЗаполнениеФактическихДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура РапределитьВсе(Команда)
	
	Объект.СводнаяТаблица.Очистить();
	РаспределитьПоЗданиям();
	
	УстановитьОтборСводнойТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоТекущейСтроке(Команда)
	
	ТекущиеДанные = Элементы.ФактическиеДанные.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		УдалитьПоСтроке(ТекущиеДанные.Идентификатор);
		
		РаспределеитьПоСтроке(ТекущиеДанные.ПолучитьИдентификатор());
		
	КонецЕсли;
	
	УстановитьОтборСводнойТаблицы();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокЗданийЗданиеПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УсловияОтбора = Новый Структура;
	УсловияОтбора.Вставить("Организация", Объект.Организация);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", УсловияОтбора);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗданийЗданиеПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СписокЗданий.ТекущиеДанные;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Здание"        , ВыбранноеЗначение);
	
	МассивСтрок = Объект.СписокЗданий.НайтиСтроки(Отбор);
	
	Если МассивСтрок.Количество() > 0 Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Здание уже выбрано.";
		Сообщение.Сообщить();
		
	Иначе 
		
		ПочтовыйАдрес = ПочтовыйАдресНаСервере(ВыбранноеЗначение);
		Улица = УлицаНаСервере(ВыбранноеЗначение);
		
		ТекущиеДанные.Адрес               = ПочтовыйАдрес;
		ТекущиеДанные.Здание              = ВыбранноеЗначение;
		ТекущиеДанные.ЗданиеПредставление = "ул." + Улица + " ,д " + ВыбранноеЗначение;
		
		Если ЗначениеЗаполнено(Объект.СпособРаспределения) Тогда
			ЗаполнитьПроцентыСписокЗданий();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПочтовыйАдресНаСервере(ВыбранноеЗначение)
	
	Возврат ВыбранноеЗначение.ПочтовыйАдрес;
	
КонецФункции

&НаСервере
Функция УлицаНаСервере(ВыбранноеЗначение)
	
	Возврат ВыбранноеЗначение.Улица;
	
КонецФункции

&НаКлиенте
Процедура СписокЗданийЗданиеПредставлениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокЗданийПроцентПриИзменении(Элемент)
	
	ПроцентИтог = Объект.СписокЗданий.Итог("Процент");
	
	ТекстПодвала = "";
	
	Если ПроцентИтог > 100 Тогда
		
		Процент = ПроцентИтог - 100;
		
		ТекстПодвала  = "Превышен на : " + Процент
		
	КонецЕсли;
	
	Элементы.СписокЗданийПроцент.ТекстПодвала = ТекстПодвала;
	
КонецПроцедуры

&НаКлиенте
Процедура СводнаяТаблицаЗданиеПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УсловияОтбора = Новый Структура;
	УсловияОтбора.Вставить("Организация", Объект.Организация);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", УсловияОтбора);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СводнаяТаблицаЗданиеПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.СводнаяТаблица.ТекущиеДанные;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИД"            , Элементы.СводнаяТаблица.ОтборСтрок.ИД);
	Отбор.Вставить("Здание"        , ВыбранноеЗначение);
	
	МассивСтрок = Объект.СводнаяТаблица.НайтиСтроки(Отбор);
	
	Если МассивСтрок.Количество() = 0 Тогда
		
		ТекущиеДанные.Здание              = ВыбранноеЗначение;
		ТекущиеДанные.ЗданиеПредставление = "ул." + ВыбранноеЗначение.Улица + " ,д " + ВыбранноеЗначение;
		
		ТекущиеДанныеДрева   = Элементы.ФактическиеДанные.ТекущиеДанные;
		
		Если ТекущиеДанныеДрева = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнитьПроцентСводнаяТаблица(ТекущиеДанныеДрева.Сумма);
		
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Здание уже выбрано.";
		Сообщение.Сообщить();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СводнаяТаблицаЗданиеПредставлениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
КонецПроцедуры

&НаКлиенте
Процедура СводнаяТаблицаПроцентПриИзменении(Элемент)
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("ИД", Элементы.СводнаяТаблица.ОтборСтрок.ИД);
	
	ПроцентИтог = ВычислитьИтогСОтбором("СводнаяТаблица", Отбор, "Процент");
	
	СуммаКонтроль = Элементы.ФактическиеДанные.ТекущиеДанные.Сумма;
	
	ТекстПодвала = "";
	
	Если ПроцентИтог > 100 Тогда
		
		Процент = ПроцентИтог - 100;
		
		ТекстПодвала  = "Превышен на : " + Процент
		
	Иначе
		
		РазбитьСуммуПоЗданиям(Отбор, СуммаКонтроль);
		
	КонецЕсли;
	
	Элементы.СводнаяТаблицаПроцент.ТекстПодвала = ТекстПодвала;
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическиеДанныеСтатьяОборотовПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ФактическиеДанные.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		ИзменитьПостроке(ТекущиеДанные.Идентификатор, "СтатьяОборотов", ТекущиеДанные.СтатьяОборотов);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляСводнаяТаблица

&НаКлиенте
Процедура СводнаяТаблицаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	
	ТекущиеДанные = Элементы.ФактическиеДанные.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекОтборСтрок = Элементы.СводнаяТаблица.ОтборСтрок;
	
	Если ТекОтборСтрок = Неопределено ИЛИ Не ТекОтборСтрок.Свойство("ИД") Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Невозможно добавить данные: не установлены отборы в таблице.";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СводнаяТаблицаПередУдалением(Элемент, Отказ)
	
	ТекОтборСтрок = Элементы.СводнаяТаблица.ОтборСтрок;
	
	Если ТекОтборСтрок = Неопределено ИЛИ Не ТекОтборСтрок.Свойство("ИД") Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Невозможно удалить данные: не установлены отборы в таблице.";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СводнаяТаблицаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.СводнаяТаблица.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекФактДанные = Элементы.ФактическиеДанные.ТекущиеДанные;
	
	ТекОтборСтрок = Элементы.СводнаяТаблица.ОтборСтрок;
	
	Если Не Копирование И НоваяСтрока Тогда
		
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ТекФактДанные);
		ТекущиеДанные.ИД    = ТекОтборСтрок.ИД;
		ТекущиеДанные.Сумма = 0; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляФактическиеДанные

&НаКлиенте
Процедура ФактическиеДанныеПриАктивизацииСтроки(Элемент)
	
	СуммаИтого = 0;
	УстановитьОтборСводнойТаблицы();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Перечисления.
	КэшПеречисления = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаполнениеФактическихДанных()
	
	Объект.ФактическиеДанные.Очистить();
	Объект.СводнаяТаблица.Очистить();
	
	Источники = ИсточникиДанныхДерево.ПолучитьЭлементы();
	
	Для каждого СтрокаТаблицы Из Источники Цикл
		
		Если НЕ СтрокаТаблицы.Использовать Тогда
			Продолжить;
		КонецЕсли; 
		
		ИсточникДанных = ПолучитьДанныеПоисточнику(СтрокаТаблицы.ИсточникДанных);
		
		Если ИсточникДанных = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ГраницаНачало = Новый Граница(НачалоМесяца(Объект.НачалоПериода), ВидГраницы.Включая);
		ГраницаКонец  = Новый Граница(КонецМесяца(Объект.КонецПериода), ВидГраницы.Включая);
		
		
		СтруктураНастроек = Документы.бит_ПолучениеФакта.ПолучитьПустуюСтруктуруНастроек();
		// Обязательные поля запроса.
		
		СтруктураНастроек.ОбязательныеПоля.Добавить("СтатьяОборотов");
		СтруктураНастроек.ОбязательныеПоля.Добавить("Субконто1");
		СтруктураНастроек.ОбязательныеПоля.Добавить("Субконто2");
		СтруктураНастроек.ОбязательныеПоля.Добавить("Субконто3");
		СтруктураНастроек.ОбязательныеПоля.Добавить("Подразделение");
		СтруктураНастроек.ОбязательныеПоля.Добавить("СуммаОборотДт");
		СтруктураНастроек.ОбязательныеПоля.Добавить("СуммаОборотКт");
		СтруктураНастроек.ОбязательныеПоля.Добавить("СуммаОборот");
		СтруктураНастроек.ОбязательныеПоля.Добавить("Период");
		
		// Параметры запроса.
		СтруктураНастроек.ПараметрыДанных.Вставить("Организация"        , Объект.Организация);
		СтруктураНастроек.ПараметрыДанных.Вставить("ГраницаНачало"      , ГраницаНачало);
		СтруктураНастроек.ПараметрыДанных.Вставить("ГраницаКонец"       , ГраницаКонец);
		СтруктураНастроек.ПараметрыДанных.Вставить("Счет"               , ИсточникДанных.Счет);
		
		// Компоновщик настроек.
		СтруктураНастроек.КомпоновщикНастроек = ИсточникДанных.НастройкиКомпоновщика.Получить();
		
		// Запрос.
		СтруктураНастроек.Запрос = ИсточникДанных.Запрос;
		
		СтруктураРезультата = Документы.бит_ПолучениеФакта.ПодготовитьСтруктуруДанных(СтруктураНастроек);
		
		Выборка = СтруктураРезультата.РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка[ИсточникДанных.ПолеСуммы] = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			НоваяСтрока = Объект.ФактическиеДанные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			НоваяСтрока.Сумма          = Выборка[ИсточникДанных.ПолеСуммы];
			НоваяСтрока.ИсточникДанных = СтрокаТаблицы.ИсточникДанных;
			НоваяСтрока.Идентификатор  = Новый УникальныйИдентификатор;
			
			
			Попытка
				НоваяСтрока.Здание = Выборка.КорСубконто1бит_ЛицевойСчетЗдание;
			Исключение
				
			КонецПопытки;
			
			Попытка
				НоваяСтрока.Здание = Выборка.КорСубконто1Здание;
			Исключение
				
			КонецПопытки;
			
			Попытка
				НоваяСтрока.Здание = Выборка.Субконто1бит_ЛицевойСчетЗдание;
			Исключение
				
			КонецПопытки;
			
			Попытка
				НоваяСтрока.Здание = Выборка.Субконто1Здание;
			Исключение
				
			КонецПопытки;
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	Объект.ФактическиеДанные.Сортировать("Период");
	
	Элементы.Итог.Заголовок = "Итого: " + Объект.ФактическиеДанные.Итог("Сумма") + "    ";
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоисточнику(ИсточникПоказаний)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИсточникПоказаний", ИсточникПоказаний);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ИсточникиДанных.Счет,
	|	бит_ИсточникиДанных.ПолеСуммы,
	|	бит_ИсточникиДанных.Запрос,
	|	бит_ИсточникиДанных.НастройкиКомпоновщика
	|ИЗ
	|	Справочник.бит_ИсточникиДанных КАК бит_ИсточникиДанных
	|ГДЕ
	|	бит_ИсточникиДанных.Ссылка = &ИсточникПоказаний";
	
	ДанныеБДПоИсточнику = Новый Структура("Счет,
	|ПолеСуммы,
	|Запрос,
	|НастройкиКомпоновщика");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ДанныеБДПоИсточнику, Выборка);
		Возврат ДанныеБДПоИсточнику;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли; 
	
КонецФункции

&НаСервере
Процедура РаспределитьПоЗданиям()
	
	Для каждого СтрокаТаблицы Из Объект.ФактическиеДанные Цикл
		
		РаспределеитьПоСтроке(СтрокаТаблицы.ПолучитьИдентификатор());
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура РаспределеитьПоСтроке(ИсточникИД)
	
	Источник = Объект.ФактическиеДанные.НайтиПоИдентификатору(ИсточникИД);
	
	Если Источник = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ Источник.Здание.Пустая() Тогда
		
		НоваяСтрока = Объект.СводнаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Источник);
		НоваяСтрока.ИД = Источник.Идентификатор;
		НоваяСтрока.Процент = 100;
		НоваяСтрока.ЗданиеПредставление = "ул." + Источник.Здание.Улица + " ,д " + Источник.Здание;
		
		Возврат;
		
	КонецЕсли; 
	
	ТаблицаИсточников  = ИсточникиДанныхДерево.ПолучитьЭлементы();
	НастройкаИсточника = Неопределено;
	
	Для каждого Строка Из ТаблицаИсточников Цикл
		Если Строка.ИсточникДанных = Источник.ИсточникДанных Тогда
			НастройкаИсточника = Строка;
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	РаспределятьПоНастройке = Ложь;
	СпособРаспПоНастройке   = Неопределено;
	
	Если НЕ НастройкаИсточника = Неопределено Тогда
		
		РаспределятьПоНастройке = НЕ НастройкаИсточника.ПроцентПревышен;
		СпособРаспПоНастройке   = НастройкаИсточника.СпособРаспределения;
		
	КонецЕсли; 
	
	Таблица = Объект.СписокЗданий;
	ИмяПоляПроцент             = "Процент";
	ИмяПоляЗданиеПредставление = "ЗданиеПредставление";
	
	СпособРасп = Объект.СпособРаспределения;
	
	Если ЗначениеЗаполнено(Источник.Подразделение) Тогда
		
		СпособРасп = ?(ЗначениеЗаполнено(СпособРаспПоНастройке), СпособРаспПоНастройке, СпособРасп);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Подразделение", Источник.Подразделение);
		Запрос.УстановитьПараметр("ВидСвойства"  , СпособРасп);
		Запрос.УстановитьПараметр("Период"       , КонецДня(Объект.Дата));
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_Подразделение_ЗданиеСрезПоследних.Здание,
		|	ЕСТЬNULL(бит_ЗначениеСвойствОбъектовУчета.Значение, 0) КАК Значение,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Процент,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(150)) КАК ЗданиеПредставление,
		|	бит_Подразделение_ЗданиеСрезПоследних.Здание.Улица КАК Улица
		|ИЗ
		|	РегистрСведений.бит_Подразделение_Здание.СрезПоследних(&Период, Подразделение = &Подразделение) КАК бит_Подразделение_ЗданиеСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК бит_ЗначениеСвойствОбъектовУчета
		|		ПО бит_Подразделение_ЗданиеСрезПоследних.Здание = бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета
		|ГДЕ
		|	бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = &ВидСвойства";
		
		Таблица = Запрос.Выполнить().Выгрузить();
		
		ПроцентИтог = Таблица.Итог("Значение");
		Если ПроцентИтог > 0 Тогда
			Для каждого СтрокаТаблицы Из Таблица Цикл
				
				СтрокаТаблицы.Процент             = Окр(СтрокаТаблицы.Значение * 100 / ПроцентИтог, 2);
				СтрокаТаблицы.ЗданиеПредставление = "ул." + СтрокаТаблицы.Улица + " ,д " + СтрокаТаблицы.Здание
				
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли РаспределятьПоНастройке Тогда
		
		Настройки =  НастройкаИсточника.ПолучитьЭлементы();
		Если Настройки.Количество() > 0 Тогда
			
			Таблица = Настройки;
			
			ИмяПоляПроцент             = "СпособРаспределения";
			ИмяПоляЗданиеПредставление = "ИсточникДанных";
			СпособРасп = ?(ЗначениеЗаполнено(СпособРаспПоНастройке), СпособРаспПоНастройке, СпособРасп);
			
		КонецЕсли; 
		
	КонецЕсли;
	
	СтрокаМаксСумма = Неопределено;
	
	СуммаИтог = 0;
	
	Для каждого СтрокаТаблицы Из Таблица Цикл
		
		НоваяСтрока = Объект.СводнаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Источник);
		НоваяСтрока.ИД                  = Источник.Идентификатор;
		НоваяСтрока.Здание              = СтрокаТаблицы.Здание;
		НоваяСтрока.СпособРаспределения = СпособРасп;
		НоваяСтрока.ЗданиеПредставление = СтрокаТаблицы[ИмяПоляЗданиеПредставление];
		
		Процент = СтрокаТаблицы[ИмяПоляПроцент];
		
		Сумма = Окр(Источник.Сумма * Процент / 100,2);
		
		НоваяСтрока.Сумма   = Сумма;
		НоваяСтрока.Процент = Процент;
		
		Если СтрокаМаксСумма = Неопределено Тогда
			
			СтрокаМаксСумма = НоваяСтрока;
			
		Иначе
			
			Если СтрокаМаксСумма.Сумма < Сумма Тогда
				
				СтрокаМаксСумма = НоваяСтрока;
				
			КонецЕсли; 
			
		КонецЕсли;
		
		СуммаИтог = СуммаИтог + Сумма;
		
	КонецЦикла;
	
	Остаток = Источник.Сумма - СуммаИтог;
	
	Если НЕ СтрокаМаксСумма = Неопределено И НЕ Остаток = 0 Тогда
		
		СтрокаМаксСумма.Сумма = СтрокаМаксСумма.Сумма + Остаток; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическиеДанныеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФактическиеДанныеПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ФактическиеДанные.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		УдалитьПоСтроке(ТекущиеДанные.Идентификатор);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРаспределенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.Форма.ФормаВыбора", Новый Структура("ТолькоЧисло", Истина), Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроцентыСписокЗданий()
	
	тмпСписокЗданий = Объект.СписокЗданий.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокЗданий"       , тмпСписокЗданий);
	Запрос.УстановитьПараметр("СпособРаспределения", Объект.СпособРаспределения);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокЗданий.Здание,
	|	СписокЗданий.ЗданиеПредставление,
	|	СписокЗданий.Адрес,
	|	СписокЗданий.Процент
	|ПОМЕСТИТЬ Здания
	|ИЗ
	|	&СписокЗданий КАК СписокЗданий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ЗначениеСвойствОбъектовУчета.Значение,
	|	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета
	|ПОМЕСТИТЬ ХаррактеристеткиЗданий
	|ИЗ
	|	РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК бит_ЗначениеСвойствОбъектовУчета
	|ГДЕ
	|	бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = &СпособРаспределения
	|	И бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				таб.Здание
	|			ИЗ
	|				Здания КАК таб)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Здания.Здание,
	|	Здания.ЗданиеПредставление,
	|	Здания.Адрес,
	|	Здания.Процент,
	|	ЕстьNull(ХаррактеристеткиЗданий.Значение,0) КАК Значение
	|ИЗ
	|	Здания КАК Здания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ХаррактеристеткиЗданий КАК ХаррактеристеткиЗданий
	|		ПО Здания.Здание = ХаррактеристеткиЗданий.ОбъектУчета";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	ПроцентИтог = Таблица.Итог("Значение");
	
	Если ПроцентИтог <= 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из Таблица Цикл
		
		СтрокаТаблицы.Процент = Окр( СтрокаТаблицы.Значение * 100 / ПроцентИтог, 2);
		
	КонецЦикла;
	
	Объект.СписокЗданий.Очистить();
	Объект.СписокЗданий.Загрузить(Таблица);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРаспределенияПриИзменении(Элемент)
	
	ЗаполнитьПроцентыСписокЗданий();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРаспределенияСводнаяТаблицаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.Форма.ФормаВыбора", Новый Структура("ТолькоЧисло", Истина), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРаспределенияСводнаяТаблицаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ФактическиеДанные.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПроцентСводнаяТаблица(ТекущиеДанные.Сумма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроцентСводнаяТаблица(СуммаРаспределения)
	
	ФиксированаяСтруктура = Элементы.СводнаяТаблица.ОтборСтрок;
	
	Отбор = Новый Структура;
	Для каждого КлючЗначение Из ФиксированаяСтруктура Цикл
		
		Отбор.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		
	КонецЦикла; 
	
	СтрокиПосика = Объект.СводнаяТаблица.НайтиСтроки(Отбор);
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Здание" , Новый ОписаниеТипов("СправочникСсылка.бит_списокЗданий"));
	Таблица.Колонки.Добавить("Процент", ОбщегоНазначения.ОписаниеТипаЧисло(5,2));
	Таблица.Колонки.Добавить("Сумма"  , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	Для каждого СтрокаТаблицы Из СтрокиПосика Цикл
		
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокЗданий"       , Таблица);
	Запрос.УстановитьПараметр("СпособРаспределения", СпособРаспределения);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокЗданий.Здание,
	|	СписокЗданий.Сумма,
	|	СписокЗданий.Процент
	|ПОМЕСТИТЬ Здания
	|ИЗ
	|	&СписокЗданий КАК СписокЗданий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ЗначениеСвойствОбъектовУчета.Значение,
	|	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета
	|ПОМЕСТИТЬ ХаррактеристеткиЗданий
	|ИЗ
	|	РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК бит_ЗначениеСвойствОбъектовУчета
	|ГДЕ
	|	бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = &СпособРаспределения
	|	И бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				таб.Здание
	|			ИЗ
	|				Здания КАК таб)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Здания.Здание,
	|	Здания.Сумма,
	|	Здания.Процент,
	|	ЕстьNull(ХаррактеристеткиЗданий.Значение,0) КАК Значение
	|ИЗ
	|	Здания КАК Здания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ХаррактеристеткиЗданий КАК ХаррактеристеткиЗданий
	|		ПО Здания.Здание = ХаррактеристеткиЗданий.ОбъектУчета";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	ПроцентИтог = Таблица.Итог("Значение");
	
	Для каждого СтрокаТаблицы Из СтрокиПосика Цикл
		
		Процент = 0;
		
		СтрокаПроцент = Таблица.Найти(СтрокаТаблицы.Здание, "Здание");
		
		Если не СтрокаПроцент = Неопределено Тогда
			
			Если ПроцентИтог > 0 Тогда
				Процент = Окр(СтрокаПроцент.Значение * 100 / ПроцентИтог, 2);
			КонецЕсли;
			
			СтрокаТаблицы.Процент = Процент;
			
			СтрокаТаблицы.Сумма = Окр((СуммаРаспределения * Процент)/100, 2);
			
			СтрокаТаблицы.СпособРаспределения = СпособРаспределения;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСводнойТаблицы()
	
	ТекущиеДанные = Элементы.ФактическиеДанные.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		СтруктураПараметров = Новый Структура("ИД", ТекущиеДанные.Идентификатор);
		
		Элементы.СводнаяТаблица.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПараметров);
		
		Строки = Объект.СводнаяТаблица.НайтиСтроки(СтруктураПараметров);
		
		Если Строки.количество() > 0 Тогда
			
			СпособРаспределения = Строки[0].СпособРаспределения;
			
			Для каждого СтрокаСводнаяТаблица Из Строки Цикл
				
				СуммаИтого = СуммаИтого + СтрокаСводнаяТаблица.Сумма;
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ИсточникиДанных = ТекущийОбъект.ИсточникиДанных;
	ИсточникиДанных.Очистить();
	
	Корень = ИсточникиДанныхДерево.ПолучитьЭлементы();
	
	Для каждого СтрокаТаблицыКорня Из Корень Цикл
		
		Таблица = СтрокаТаблицыКорня.ПолучитьЭлементы();
		
		Если Таблица.Количество() = 0 Тогда
			
			НоваяСтрока = ИсточникиДанных.Добавить();
			НоваяСтрока.Использовать        = СтрокаТаблицыКорня.Использовать;
			НоваяСтрока.ИсточникДанных      = СтрокаТаблицыКорня.ИсточникДанных;
			НоваяСтрока.СпособРаспределения = СтрокаТаблицыКорня.СпособРаспределения;
			НоваяСтрока.ПроцентПревышен     = СтрокаТаблицыКорня.ПроцентПревышен;
			
		Иначе
			
			Для каждого СтрокаТаблицы Из Таблица Цикл
				
				НоваяСтрока = ИсточникиДанных.Добавить();
				НоваяСтрока.Использовать        = СтрокаТаблицыКорня.Использовать;
				НоваяСтрока.ИсточникДанных      = СтрокаТаблицыКорня.ИсточникДанных;
				НоваяСтрока.СпособРаспределения = СтрокаТаблицыКорня.СпособРаспределения;
				НоваяСтрока.ЗданиеПредставление = СтрокаТаблицы.ИсточникДанных;
				НоваяСтрока.Здание              = СтрокаТаблицы.Здание;
				НоваяСтрока.Процент             = СтрокаТаблицы.СпособРаспределения;
				НоваяСтрока.ПроцентПревышен     = СтрокаТаблицыКорня.ПроцентПревышен;
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИсточникиДанныхДерево()
	
	Таблица = Объект.ИсточникиДанных.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Использовать,
	|	Таблица.ИсточникДанных,
	|	Таблица.СпособРаспределения,
	|	Таблица.Здание,
	|	Таблица.Процент,
	|	Таблица.ЗданиеПредставление,
	|	Таблица.ПроцентПревышен
	|ПОМЕСТИТЬ ИсточникиДанных
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсточникиДанных.Использовать КАК Использовать,
	|	ИсточникиДанных.ИсточникДанных КАК ИсточникДанных,
	|	ИсточникиДанных.СпособРаспределения КАК СпособРаспределения,
	|	ИсточникиДанных.Здание,
	|	ИсточникиДанных.Процент,
	|	ИсточникиДанных.ЗданиеПредставление,
	|	ИсточникиДанных.ПроцентПревышен КАК ПроцентПревышен
	|ИЗ
	|	ИсточникиДанных КАК ИсточникиДанных
	|ИТОГИ
	|	МАКСИМУМ(Использовать),
	|	МАКСИМУМ(СпособРаспределения),
	|	МАКСИМУМ(ПроцентПревышен)
	|ПО
	|	ИсточникДанных";
	
	ВыборкаИД = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Корень =  ИсточникиДанныхДерево.ПолучитьЭлементы();
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.бит_ИсточникиДанных"));
	МассивТипов.Добавить(Тип("Строка"));
	МассивТипов.Добавить(Тип("Число"));
	МассивТипов.Добавить(Тип("ПланВидовХарактеристикСсылка.бит_СвойстваОбъектовУчета"));
	
	ОписаниеТипаИсточника = Новый ОписаниеТипов(МассивТипов);
	
	Пока ВыборкаИД.Следующий() Цикл
		
		НоваяСтрокаКорень = Корень.Добавить();
		НоваяСтрокаКорень.Использовать        = ВыборкаИД.Использовать;
		НоваяСтрокаКорень.ИсточникДанных      = ОписаниеТипаИсточника.ПривестиЗначение(ВыборкаИД.ИсточникДанных);
		НоваяСтрокаКорень.СпособРаспределения = ОписаниеТипаИсточника.ПривестиЗначение(ВыборкаИД.СпособРаспределения);
		НоваяСтрокаКорень.ЭтоРодитель         = Истина;
		НоваяСтрокаКорень.ПроцентПревышен     = ВыборкаИД.ПроцентПревышен;
		
		Таблица = НоваяСтрокаКорень.ПолучитьЭлементы();
		
		Выборка = ВыборкаИД.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.Здание) Тогда
				
				НоваяСтрока = Таблица.Добавить();
				НоваяСтрока.ИсточникДанных      = ОписаниеТипаИсточника.ПривестиЗначение(Выборка.ЗданиеПредставление);
				НоваяСтрока.Здание              = Выборка.Здание;
				НоваяСтрока.СпособРаспределения = ОписаниеТипаИсточника.ПривестиЗначение(Выборка.Процент);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИсточник(Команда)
	
	Корень = ИсточникиДанныхДерево.ПолучитьЭлементы();
	ПервыйУровень = Корень.Добавить();
	
	ПервыйУровень.ЭтоРодитель = Истина;
	
	Элементы.ИсточникиДанныхДерево.ТекущаяСтрока  = ПервыйУровень.ПолучитьИдентификатор();
	Элементы.ИсточникиДанныхДерево.ТекущийЭлемент = Элементы.ИсточникиДанныхДеревоИсточникДанных;
	Элементы.ИсточникиДанныхДерево.ИзменитьСтроку();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникиДанныхДеревоИсточникДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ИсточникиДанныхДерево.ТекущиеДанные;
	
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		ОткрытьФорму("Справочник.бит_ИсточникиДанных.Форма.ФормаВыбора", ,Элемент);
	Иначе  
		ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", ,Элемент);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗданий(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая",ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая" Тогда
		
		Если ВыбранноеЗначение = Неопределено ИЛИ ВыбранноеЗначение.Количество() = 0 Тогда
			Возврат;
		КонецЕсли; 
		
		ТекущиеДанные = Элементы.ИсточникиДанныхДерево.ТекущиеДанные;
		
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли; 
		
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		
		Если Родитель = Неопределено Тогда
			Корень = ТекущиеДанные;
		Иначе
			Корень = Родитель;
		КонецЕсли; 
		
		ЗаполнитьПроцентыВДереве(Корень.ПолучитьИдентификатор(), ВыбранноеЗначение);
		
		РазвернутьВсеУровни();
		
		Модифицированность = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроцентыВДереве(Идентификатор, Здания = Неопределено)
	
	Корень = ИсточникиДанныхДерево.НайтиПоИдентификатору(Идентификатор);
	
	Если Корень = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Корень.СпособРаспределения) Тогда
		Возврат;
	КонецЕсли; 
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Здание"             , Новый ОписаниеТипов("СправочникСсылка.бит_списокЗданий"));
	Таблица.Колонки.Добавить("Процент"            , ОбщегоНазначения.ОписаниеТипаЧисло(5,2));
	Таблица.Колонки.Добавить("ЗданиеПредставление", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	
	ТаблицаИсточник = Корень.ПолучитьЭлементы();
	
	Для каждого СтрокаТаблицы Из ТаблицаИсточник Цикл
		
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Здание              = СтрокаТаблицы.Здание;
		НоваяСтрока.Процент             = СтрокаТаблицы.СпособРаспределения;
		НоваяСтрока.ЗданиеПредставление = СтрокаТаблицы.ИсточникДанных;
		
	КонецЦикла;
	
	Если НЕ Здания = Неопределено Тогда
		Для каждого Элемент Из Здания Цикл
			
			Если Таблица.Найти(Элемент, "Здание") = Неопределено Тогда
				
				НоваяСтрока = Таблица.Добавить();
				НоваяСтрока.Здание         = Элемент;
				НоваяСтрока.ЗданиеПредставление = "ул." + Элемент.Улица + " ,д" + Элемент;
				
			КонецЕсли; 
			
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокЗданий"       , Таблица);
	Запрос.УстановитьПараметр("СпособРаспределения", Корень.СпособРаспределения);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокЗданий.Здание,
	|	СписокЗданий.ЗданиеПредставление,
	|	СписокЗданий.Процент
	|ПОМЕСТИТЬ Здания
	|ИЗ
	|	&СписокЗданий КАК СписокЗданий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ЗначениеСвойствОбъектовУчета.Значение,
	|	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета
	|ПОМЕСТИТЬ ХаррактеристеткиЗданий
	|ИЗ
	|	РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК бит_ЗначениеСвойствОбъектовУчета
	|ГДЕ
	|	бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = &СпособРаспределения
	|	И бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				таб.Здание
	|			ИЗ
	|				Здания КАК таб)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Здания.Здание,
	|	Здания.ЗданиеПредставление,
	|	Здания.Процент,
	|	ЕстьNull(ХаррактеристеткиЗданий.Значение,0) КАК Значение
	|ИЗ
	|	Здания КАК Здания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ХаррактеристеткиЗданий КАК ХаррактеристеткиЗданий
	|		ПО Здания.Здание = ХаррактеристеткиЗданий.ОбъектУчета";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	ЗначениеИтог = Таблица.Итог("Значение");
	ПроцентИтог  = Таблица.Итог("Процент");
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	МассивТипов.Добавить(Тип("Число"));
	
	ОписаниеТипаИсточника = Новый ОписаниеТипов(МассивТипов);
	
	ТаблицаИсточник.Очистить();
	
	Для каждого СтрокаТаблицы Из Таблица Цикл
		
		Процент = 0;
		
		Если ЗначениеИтог > 0 Тогда
			Процент = Окр(СтрокаТаблицы.Значение * 100 / ЗначениеИтог, 2);
		КонецЕсли;
		
		НоваяСтрока = ТаблицаИсточник.Добавить();
		НоваяСтрока.ИсточникДанных      = ОписаниеТипаИсточника.ПривестиЗначение(СтрокаТаблицы.ЗданиеПредставление);
		НоваяСтрока.Здание              = СтрокаТаблицы.Здание;
		НоваяСтрока.СпособРаспределения = ОписаниеТипаИсточника.ПривестиЗначение(Процент);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникиДанныхДеревоСпособРаспределенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ИсточникиДанныхДерево.ТекущиеДанные;
	
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		ОткрытьФорму("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.Форма.ФормаВыбора", ,Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникиДанныхДеревоПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ИсточникиДанныхДерево.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		
		Элементы.ИсточникиДанныхДеревоСпособРаспределения.КнопкаВыбора = Ложь;
	Иначе
		
		Элементы.ИсточникиДанныхДеревоСпособРаспределения.КнопкаВыбора = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникиДанныхДеревоСпособРаспределенияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ИсточникиДанныхДерево.ТекущиеДанные;
	
	Если ТипЗнч(ТекущиеДанные.СпособРаспределения) = Тип("ПланВидовХарактеристикСсылка.бит_СвойстваОбъектовУчета") Тогда
		
		ЗаполнитьПроцентыВДереве(ТекущиеДанные.ПолучитьИдентификатор());
		
	КонецЕсли; 
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникиДанныхДеревоИсточникДанныхОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ИсточникиДанныхДерево.ТекущиеДанные;
	
	Корень = ТекущиеДанные.ПолучитьРодителя();
	
	Если НЕ Корень = Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Отказ = Ложь;
		
		Таблица = Корень.ПолучитьЭлементы();
		
		Для каждого Строка Из Таблица Цикл
			
			Если Строка.Здание = ВыбранноеЗначение Тогда
				
				Отказ = Истина;
				Прервать;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		Если Отказ Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Здание уже выбрано.";
			Сообщение.Сообщить();
			
		Иначе 
			
			ТекущиеДанные.Здание         = ВыбранноеЗначение;
			ТекущиеДанные.ИсточникДанных = "ул." + ВыбранноеЗначение.Улица + " ,д" + ВыбранноеЗначение;
			
			Если ЗначениеЗаполнено(Корень.СпособРаспределения) Тогда
				ЗаполнитьПроцентыВДереве(Корень.ПолучитьИдентификатор());
			КонецЕсли;
			
			Модифицированность = Истина;
			
		КонецЕсли;
		
	Иначе
		
		Таблица = ИсточникиДанныхДерево.ПолучитьЭлементы();
		
		Для каждого Строка Из Таблица Цикл
			
			Если Строка.ИсточникДанных = ВыбранноеЗначение Тогда
				
				СтандартнаяОбработка = Ложь;
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Источник данных уже выбран.";
				Сообщение.Сообщить();
				
				Прервать;
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсеУровни()
	
	Таблица = ИсточникиДанныхДерево.ПолучитьЭлементы();
	
	Для каждого СтрокаТаблицы Из Таблица Цикл
		
		Элементы.ИсточникиДанныхДерево.Развернуть(СтрокаТаблицы.ПолучитьИдентификатор());
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникиДанныхДеревоИсточникДанныхПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ИсточникиДанныхДерево.ТекущиеДанные;
	
	ТекущиеДанные.Использовать = Истина;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникиДанныхДеревоСпособРаспределенияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ИсточникиДанныхДерево.ТекущиеДанные;
	
	Корень = ТекущиеДанные.ПолучитьРодителя();
	
	Если НЕ Корень = Неопределено Тогда
		
		Таблица = Корень.ПолучитьЭлементы();
		
		Итог = 0;
		
		Для каждого СтрокаТаблицы Из Таблица Цикл
			
			Если СтрокаТаблицы.ИсточникДанных = ТекущиеДанные.ИсточникДанных Тогда
				Итог = Итог + Число(Текст);
			Иначе
				Итог = Итог + СтрокаТаблицы.СпособРаспределения;
			КонецЕсли; 
			
		КонецЦикла;
		
		Если Итог > 100  Тогда
			
			Корень.ПроцентПревышен = Истина;
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Процент превышен!";
			Сообщение.Сообщить();
			
		Иначе
			Корень.ПроцентПревышен = Ложь;
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникиДанныхДеревоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИсточникиДанныхДеревоИспользоватьПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИсточникиДанныхДеревоПередУдалением(Элемент, Отказ)
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Элементы.ИсточникиДанныхДерево.ТекущиеДанные;
	
	Корень = ТекущиеДанные.ПолучитьРодителя();
	
	Если НЕ Корень = Неопределено Тогда
		
		мИдентификаторРодитель = Корень.ПолучитьИдентификатор();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникиДанныхДеревоПослеУдаления(Элемент)
	
	Если НЕ мИдентификаторРодитель = Неопределено Тогда
		
		ЗаполнитьПроцентыВДереве(мИдентификаторРодитель);
		мИдентификаторРодитель = Неопределено;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СводнаяТаблицаПослеУдаления(Элемент)
	
	ТекущиеДанные = Элементы.ФактическиеДанные.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СпособРаспределения) Тогда
		
		ЗаполнитьПроцентСводнаяТаблица(ТекущиеДанные.Сумма);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗданийПослеУдаления(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СпособРаспределения) Тогда
		
		ЗаполнитьПроцентыСписокЗданий();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическиеДанныеРегистраторНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ФактическиеДанныеРегистраторОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлаги(Команда)
	
	ИзменитьФлаги(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлаги(Команда)
	
	ИзменитьФлаги(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьФлаги(Команда)
	
	ИзменитьФлаги(,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлаги(Направление = Ложь, Инвертировать = Ложь)
	
	Корень = ИсточникиДанныхДерево.ПолучитьЭлементы();
	
	Для каждого Строка Из Корень Цикл
		
		Строка.Использовать = ?(Инвертировать,НЕ Строка.Использовать, Направление);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
